app/Controllers/DataPesanan.php

SELECT *
FROM `mobil`
---
    public function laporan()
    {
        session();
        $bulan = $this->request->getVar('bulan');
        $tahun = $this->request->getVar('tahun');
        $groupModel = new GroupModel();
        if (user()->status == 1) {
            $pesanan = $this->datapesananModel->joinPesananLap($bulan, $tahun);
        } elseif (user()->status == 2) {
            $pesanan = $this->datapesananModel->joinPesananCust();
        }
        $mobil = $this->datamobilModel->getMobilStatus();
        $mobilAll = $this->datamobilModel;
        $pemesan = $this->datapemesanModel;
        $perjalanan = $this->dataperjalananModel->where('id_perjalanan !=', 0);
        $bayar = $this->databayarModel->where('id_jenisbayar !=', 0);
        $sumharga = $this->datapesananModel->joinPesananLapSum($bulan, $tahun);
        $data = [
            // 'session' => $session,
            // 'pesanan' => $pesanan->getPesanan(),
            'mobil' => $mobil->getMobil(),
            'bulan' => $bulan,
            'tahun' => $tahun,
            'mobilAll' => $mobilAll->findAll(),

SELECT *
FROM `merk`
WHERE `id_merk` = '7'
---
        ];
        foreach ($data['mobilAll'] as $row) {
            $dataRow['jumlah'] = $this->datapesananModel->hitungJumlahMobil($row['id_mobil'], 2, $bulan, $tahun);
            $dataRow['merk'] = $this->datamerkModel->where('id_merk', $row['id_merk'])->findAll();

SELECT *
FROM `mobil`
---
    public function laporanPrint()
    {
        session();
        $bulan = $this->request->getVar('bulan');
        $tahun = $this->request->getVar('tahun');
        $groupModel = new GroupModel();
        if (user()->status == 1) {
            $pesanan = $this->datapesananModel->joinPesananLap($bulan, $tahun);
        } elseif (user()->status == 2) {
            $pesanan = $this->datapesananModel->joinPesananCust();
        }
        $mobil = $this->datamobilModel->getMobilStatus();
        $mobilAll = $this->datamobilModel;
        $pemesan = $this->datapemesanModel;
        $perjalanan = $this->dataperjalananModel->where('id_perjalanan !=', 0);
        $bayar = $this->databayarModel->where('id_jenisbayar !=', 0);
        $sumharga = $this->datapesananModel->joinPesananLapSum($bulan, $tahun);
        $data = [
            // 'session' => $session,
            // 'pesanan' => $pesanan->getPesanan(),
            'mobil' => $mobil->getMobil(),
            'bulan' => $bulan,
            'tahun' => $tahun,
            'mobilAll' => $mobilAll->findAll(),

SELECT *
FROM `merk`
WHERE `id_merk` = '7'
---
        ];
        foreach ($data['mobilAll'] as $row) {
            $dataRow['jumlah'] = $this->datapesananModel->hitungJumlahMobil($row['id_mobil'], 2, $bulan, $tahun);
            $dataRow['merk'] = $this->datamerkModel->where('id_merk', $row['id_merk'])->findAll();

SELECT *
FROM `mobil`
---
    public function laporanTahun()
    {
        session();

        $tahun = $this->request->getVar('tahun');
        $groupModel = new GroupModel();
        if (user()->status == 1) {
            $pesanan = $this->datapesananModel->joinPesananLapTahun($tahun);
        } elseif (user()->status == 2) {
            $pesanan = $this->datapesananModel->joinPesananCust();
        }
        $mobil = $this->datamobilModel->getMobilStatus();
        $mobilAll = $this->datamobilModel;
        $pemesan = $this->datapemesanModel;
        $perjalanan = $this->dataperjalananModel->where('id_perjalanan !=', 0);
        $bayar = $this->databayarModel->where('id_jenisbayar !=', 0);
        $sumharga = $this->datapesananModel->joinPesananLapSumTahun($tahun);
        $data = [
            // 'session' => $session,
            // 'pesanan' => $pesanan->getPesanan(),
            'mobil' => $mobil->getMobil(),
            'tahun' => $tahun,
            'mobilAll' => $mobilAll->findAll(),

SELECT *
FROM `merk`
WHERE `id_merk` = '7'
---
        ];
        foreach ($data['mobilAll'] as $row) {
            $dataRow['jumlah'] = $this->datapesananModel->hitungJumlahMobilTahun($row['id_mobil'], 2, $tahun);
            $dataRow['merk'] = $this->datamerkModel->where('id_merk', $row['id_merk'])->findAll();

SELECT *
FROM `mobil`
---
    public function laporanUnitBulan()
    {
        session();
        $bulan = $this->request->getVar('bulan');
        $tahun = $this->request->getVar('tahun');
        $groupModel = new GroupModel();
        if (user()->status == 1) {
            $pesanan = $this->datapesananModel->joinPesananLap($bulan, $tahun);
        } elseif (user()->status == 2) {
            $pesanan = $this->datapesananModel->joinPesananCust();
        }
        $mobil = $this->datamobilModel->getMobilStatus();
        $mobilAll = $this->datamobilModel;
        $pemesan = $this->datapemesanModel;
        $perjalanan = $this->dataperjalananModel->where('id_perjalanan !=', 0);
        $bayar = $this->databayarModel->where('id_jenisbayar !=', 0);
        $sumharga = $this->datapesananModel->joinPesananLapSum($bulan, $tahun);
        $data = [
            // 'session' => $session,
            // 'pesanan' => $pesanan->getPesanan(),
            'mobil' => $mobil->getMobil(),
            'bulan' => $bulan,
            'tahun' => $tahun,
            'mobilAll' => $mobilAll->findAll(),

SELECT *
FROM `merk`
WHERE `id_merk` = '7'
---
        foreach ($data['mobilAll'] as $row) {
            $dataRow['no'] = $no++;
            $dataRow['jumlah'] = $this->datapesananModel->hitungJumlahMobil($row['id_mobil'], 2, $bulan, $tahun);
            $dataRow['merk'] = $this->datamerkModel->where('id_merk', $row['id_merk'])->findAll();

SELECT *
FROM `mobil`
---
    public function laporanUnitTahun()
    {
        session();

        $tahun = $this->request->getVar('tahun');
        $groupModel = new GroupModel();
        if (user()->status == 1) {
            $pesanan = $this->datapesananModel->joinPesananLapTahun($tahun);
        } elseif (user()->status == 2) {
            $pesanan = $this->datapesananModel->joinPesananCust();
        }
        $mobil = $this->datamobilModel->getMobilStatus();
        $mobilAll = $this->datamobilModel;
        $pemesan = $this->datapemesanModel;
        $perjalanan = $this->dataperjalananModel->where('id_perjalanan !=', 0);
        $bayar = $this->databayarModel->where('id_jenisbayar !=', 0);
        $sumharga = $this->datapesananModel->joinPesananLapSumTahun($tahun);
        $data = [
            // 'session' => $session,
            // 'pesanan' => $pesanan->getPesanan(),
            'mobil' => $mobil->getMobil(),
            'tahun' => $tahun,
            'mobilAll' => $mobilAll->findAll(),

SELECT *
FROM `merk`
WHERE `id_merk` = '7'
---
        $no = 1;
        foreach ($data['mobilAll'] as $row) {
            $dataRow['jumlah'] = $this->datapesananModel->hitungJumlahMobilTahun($row['id_mobil'], 2, $tahun);
            $dataRow['merk'] = $this->datamerkModel->where('id_merk', $row['id_merk'])->findAll();

SELECT *
FROM `mobil`
SELECT *
FROM `pengeluaran`
WHERE MONTH(created_at) = '1'
AND YEAR(created_at) = '2023'
---
    public function laporanKeuntunganBulan()
    {
        session();
        $bulan = $this->request->getVar('bulan');
        $tahun = $this->request->getVar('tahun');
        $groupModel = new GroupModel();
        if (user()->status == 1) {
            $pesanan = $this->datapesananModel->joinPesananLap($bulan, $tahun);
        } elseif (user()->status == 2) {
            $pesanan = $this->datapesananModel->joinPesananCust();
        }
        $mobil = $this->datamobilModel->getMobilStatus();
        $mobilAll = $this->datamobilModel;
        $pemesan = $this->datapemesanModel;
        $perjalanan = $this->dataperjalananModel->where('id_perjalanan !=', 0);
        $bayar = $this->databayarModel->where('id_jenisbayar !=', 0);
        $sumharga = $this->datapesananModel->joinPesananLapSum($bulan, $tahun);
        $data = [
            // 'session' => $session,
            // 'pesanan' => $pesanan->getPesanan(),
            'mobil' => $mobil->getMobil(),
            'bulan' => $bulan,
            'tahun' => $tahun,
            'mobilAll' => $mobilAll->findAll(),
            'joinmobil' => $this->datamobilModel->joinMobil(),
            'pemesan' => $pemesan->where('id !=', 0)->getPemesan(),
            'perjalanan' => $perjalanan->getPerjalanan(),
            'bayar' => $bayar->getBayar(),
            'pengeluaran' => $this->datapengeluaranModel->where('MONTH(created_at)', $bulan)->where('YEAR(created_at)', $tahun)->findAll(),

SELECT *
FROM `mobil`
SELECT *
FROM `pengeluaran`
WHERE YEAR(created_at) = '2023'
---
    public function laporanKeuntunganTahun()
    {
        session();

        $tahun = $this->request->getVar('tahun');
        $groupModel = new GroupModel();
        if (user()->status == 1) {
            $pesanan = $this->datapesananModel->joinPesananLapTahun($tahun);
        } elseif (user()->status == 2) {
            $pesanan = $this->datapesananModel->joinPesananCust();
        }
        $mobil = $this->datamobilModel->getMobilStatus();
        $mobilAll = $this->datamobilModel;
        $pemesan = $this->datapemesanModel;
        $perjalanan = $this->dataperjalananModel->where('id_perjalanan !=', 0);
        $bayar = $this->databayarModel->where('id_jenisbayar !=', 0);
        $sumharga = $this->datapesananModel->joinPesananLapSumTahun($tahun);
        $data = [
            // 'session' => $session,
            // 'pesanan' => $pesanan->getPesanan(),
            'mobil' => $mobil->getMobil(),
            'tahun' => $tahun,
            'mobilAll' => $mobilAll->findAll(),
            'joinmobil' => $this->datamobilModel->joinMobil(),
            'pemesan' => $pemesan->where('id !=', 0)->getPemesan(),
            'perjalanan' => $perjalanan->getPerjalanan(),
            'bayar' => $bayar->getBayar(),
            'joinpesanan' => $pesanan,
            'pengeluaran' => $this->datapengeluaranModel->where('YEAR(created_at)', $tahun)->findAll(),