app/Controllers/DataPengeluaran.php

    public function update($id_pengeluaran)
    {
        if (!$this->validate([
            'nama_pengeluaran' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Nama Pengeluaran Harus diisi',
                ]
            ],
            'jumlah' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Jumlah Harus diisi',
                ]
            ]

        ])) {
            session()->setFlashdata('error', $this->validator->listErrors());
            return redirect()->back()->withInput();
        }

        $this->datapengeluaranModel->save([
            'id_pengeluaran' => $id_pengeluaran,
            'nama_pengeluaran' => $this->request->getVar('nama_pengeluaran'),
            'jumlah' => $this->request->getVar('jumlah'),

        ]);
---
UPDATE `pengeluaran` SET `nama_pengeluaran` = 'dffsf', `jumlah` = '543', `updated_at` = '2023-07-27 17:01:52'
WHERE `pengeluaran`.`id_pengeluaran` IN ('2')