app/Models/DataPengeluaranModel.php

SELECT *
FROM `pengeluaran`
SELECT *
FROM `pengeluaran`
WHERE `id_pengeluaran` = '2'
 LIMIT 1
---
    public function getPengeluaran($id_pengeluaran = false)
    {
        if ($id_pengeluaran == false) {
            return $this->findAll();
        }
        return $this->where(['id_pengeluaran' => $id_pengeluaran])->first();