app/Models/DataMobilModel.php

SELECT *
FROM `mobil`
---
    public function getMobil($id_mobil = false)
    {
        if ($id_mobil == false) {
            return $this->findAll();

SELECT *
FROM `mobil`
WHERE `status` = 1
---
    public  function getMobilStatus()
    {
        return $this->table('mobil')->where('status', 1);

SELECT *
FROM `mobil`
JOIN `merk` ON `merk`.`id_merk` = `mobil`.`id_merk`
---
    public function joinMobil($id_mobil = false)
    {
        if ($id_mobil == false) {
            $db      = \Config\Database::connect();
            $builder = $db->table('mobil');
            $builder->select('*');
            $builder->join('merk', 'merk.id_merk = mobil.id_merk');
            $query = $builder->get();