app/Models/DataPesananModel.php

    public function joinPesanan($id_pesanan = false)
    {
        if ($id_pesanan == false) {
            $db      = \Config\Database::connect();
            $builder = $db->table('pesanan');
            $builder->select('*');
            $builder->join('users', 'users.id = pesanan.id_pemesan');
            $builder->join('mobil', 'mobil.id_mobil = pesanan.id_mobil');
            $builder->join('perjalanan', 'perjalanan.id_perjalanan = pesanan.id_perjalanan');
            $builder->join('jenis_bayar', 'jenis_bayar.id_jenisbayar = pesanan.id_jenisbayar');
            $query = $builder->get();
---
SELECT *
FROM `pesanan`
JOIN `users` ON `users`.`id` = `pesanan`.`id_pemesan`
JOIN `mobil` ON `mobil`.`id_mobil` = `pesanan`.`id_mobil`
JOIN `perjalanan` ON `perjalanan`.`id_perjalanan` = `pesanan`.`id_perjalanan`
JOIN `jenis_bayar` ON `jenis_bayar`.`id_jenisbayar` = `pesanan`.`id_jenisbayar`

    public function joinPesananLap($bulan, $tahun)
    {

        $db      = \Config\Database::connect();
        $builder = $db->table('pesanan');
        $builder->select('*');
        $builder->join('users', 'users.id = pesanan.id_pemesan');
        $builder->join('mobil', 'mobil.id_mobil = pesanan.id_mobil');
        $builder->join('merk', 'merk.id_merk = mobil.id_merk');
        $builder->join('perjalanan', 'perjalanan.id_perjalanan = pesanan.id_perjalanan');
        $builder->join('jenis_bayar', 'jenis_bayar.id_jenisbayar = pesanan.id_jenisbayar');
        $builder->where('proses', 2);
        $builder->where('MONTH(pesanan.tgl_pinjam)', $bulan);
        $builder->where('YEAR(pesanan.tgl_pinjam)', $tahun);
        $builder->orderBy('tgl_pinjam', 'ASC');
        $query = $builder->get();
---
SELECT *
FROM `pesanan`
JOIN `users` ON `users`.`id` = `pesanan`.`id_pemesan`
JOIN `mobil` ON `mobil`.`id_mobil` = `pesanan`.`id_mobil`
JOIN `merk` ON `merk`.`id_merk` = `mobil`.`id_merk`
JOIN `perjalanan` ON `perjalanan`.`id_perjalanan` = `pesanan`.`id_perjalanan`
JOIN `jenis_bayar` ON `jenis_bayar`.`id_jenisbayar` = `pesanan`.`id_jenisbayar`
WHERE `proses` = 2
AND MONTH(pesanan.tgl_pinjam) IS NULL
AND YEAR(pesanan.tgl_pinjam) IS NULL
ORDER BY `tgl_pinjam` ASC

    public function joinPesananLapTahun($tahun)
    {

        $db      = \Config\Database::connect();
        $builder = $db->table('pesanan');
        $builder->select('*');
        $builder->join('users', 'users.id = pesanan.id_pemesan');
        $builder->join('mobil', 'mobil.id_mobil = pesanan.id_mobil');
        $builder->join('merk', 'merk.id_merk = mobil.id_merk');
        $builder->join('perjalanan', 'perjalanan.id_perjalanan = pesanan.id_perjalanan');
        $builder->join('jenis_bayar', 'jenis_bayar.id_jenisbayar = pesanan.id_jenisbayar');
        $builder->where('proses', 2);
        $builder->where('YEAR(pesanan.tgl_pinjam)', $tahun);
        $builder->orderBy('tgl_pinjam', 'ASC');
        $query = $builder->get();
---
SELECT *
FROM `pesanan`
JOIN `users` ON `users`.`id` = `pesanan`.`id_pemesan`
JOIN `mobil` ON `mobil`.`id_mobil` = `pesanan`.`id_mobil`
JOIN `merk` ON `merk`.`id_merk` = `mobil`.`id_merk`
JOIN `perjalanan` ON `perjalanan`.`id_perjalanan` = `pesanan`.`id_perjalanan`
JOIN `jenis_bayar` ON `jenis_bayar`.`id_jenisbayar` = `pesanan`.`id_jenisbayar`
WHERE `proses` = 2
AND YEAR(pesanan.tgl_pinjam) = '2023'
ORDER BY `tgl_pinjam` ASC

    public function joinPesananLapSum($bulan, $tahun)
    {

        $db      = \Config\Database::connect();
        $builder = $db->table('pesanan');
        $builder->selectSum('harga');
        $builder->join('users', 'users.id = pesanan.id_pemesan');
        $builder->join('mobil', 'mobil.id_mobil = pesanan.id_mobil');
        $builder->join('perjalanan', 'perjalanan.id_perjalanan = pesanan.id_perjalanan');
        $builder->join('jenis_bayar', 'jenis_bayar.id_jenisbayar = pesanan.id_jenisbayar');
        $builder->where('proses', 2);
        $builder->where('MONTH(pesanan.tgl_pinjam)', $bulan);
        $builder->where('YEAR(pesanan.tgl_pinjam)', $tahun);
        $query = $builder->get();
---
SELECT SUM(`harga`) AS `harga`
FROM `pesanan`
JOIN `users` ON `users`.`id` = `pesanan`.`id_pemesan`
JOIN `mobil` ON `mobil`.`id_mobil` = `pesanan`.`id_mobil`
JOIN `perjalanan` ON `perjalanan`.`id_perjalanan` = `pesanan`.`id_perjalanan`
JOIN `jenis_bayar` ON `jenis_bayar`.`id_jenisbayar` = `pesanan`.`id_jenisbayar`
WHERE `proses` = 2
AND MONTH(pesanan.tgl_pinjam) IS NULL
AND YEAR(pesanan.tgl_pinjam) IS NULL

    public function joinPesananLapSumTahun($tahun)
    {

        $db      = \Config\Database::connect();
        $builder = $db->table('pesanan');
        $builder->selectSum('harga');
        $builder->join('users', 'users.id = pesanan.id_pemesan');
        $builder->join('mobil', 'mobil.id_mobil = pesanan.id_mobil');
        $builder->join('perjalanan', 'perjalanan.id_perjalanan = pesanan.id_perjalanan');
        $builder->join('jenis_bayar', 'jenis_bayar.id_jenisbayar = pesanan.id_jenisbayar');
        $builder->where('proses', 2);
        $builder->where('YEAR(pesanan.tgl_pinjam)', $tahun);
        $query = $builder->get();
---
SELECT SUM(`harga`) AS `harga`
FROM `pesanan`
JOIN `users` ON `users`.`id` = `pesanan`.`id_pemesan`
JOIN `mobil` ON `mobil`.`id_mobil` = `pesanan`.`id_mobil`
JOIN `perjalanan` ON `perjalanan`.`id_perjalanan` = `pesanan`.`id_perjalanan`
JOIN `jenis_bayar` ON `jenis_bayar`.`id_jenisbayar` = `pesanan`.`id_jenisbayar`
WHERE `proses` = 2
AND YEAR(pesanan.tgl_pinjam) = '2023'

    public function PesananMobilSum($id_mobil, $proses, $bulan, $tahun)
    {

        $db      = \Config\Database::connect();
        $builder = $db->table('pesanan');
        $builder->selectSum('mobil.harga');
        $builder->join('users', 'users.id = pesanan.id_pemesan');
        $builder->join('mobil', 'mobil.id_mobil = pesanan.id_mobil');
        $builder->join('perjalanan', 'perjalanan.id_perjalanan = pesanan.id_perjalanan');
        $builder->join('jenis_bayar', 'jenis_bayar.id_jenisbayar = pesanan.id_jenisbayar');
        $builder->where('pesanan.id_mobil', $id_mobil);
        $builder->where('proses', $proses);
        $builder->where('MONTH(pesanan.tgl_pinjam)', $bulan);
        $builder->where('YEAR(pesanan.tgl_pinjam)', $tahun);
        $query = $builder->get();
---
SELECT SUM(`mobil`.`harga`) AS `harga`
FROM `pesanan`
JOIN `users` ON `users`.`id` = `pesanan`.`id_pemesan`
JOIN `mobil` ON `mobil`.`id_mobil` = `pesanan`.`id_mobil`
JOIN `perjalanan` ON `perjalanan`.`id_perjalanan` = `pesanan`.`id_perjalanan`
JOIN `jenis_bayar` ON `jenis_bayar`.`id_jenisbayar` = `pesanan`.`id_jenisbayar`
WHERE `pesanan`.`id_mobil` = '10'
AND `proses` = 2
AND MONTH(pesanan.tgl_pinjam) IS NULL
AND YEAR(pesanan.tgl_pinjam) IS NULL

    public function PesananMobilSumTahun($id_mobil, $proses, $tahun)
    {

        $db      = \Config\Database::connect();
        $builder = $db->table('pesanan');
        $builder->selectSum('mobil.harga');
        $builder->join('users', 'users.id = pesanan.id_pemesan');
        $builder->join('mobil', 'mobil.id_mobil = pesanan.id_mobil');
        $builder->join('perjalanan', 'perjalanan.id_perjalanan = pesanan.id_perjalanan');
        $builder->join('jenis_bayar', 'jenis_bayar.id_jenisbayar = pesanan.id_jenisbayar');
        $builder->where('pesanan.id_mobil', $id_mobil);
        $builder->where('proses', $proses);
        $builder->where('YEAR(pesanan.tgl_pinjam)', $tahun);
        $query = $builder->get();
---
SELECT SUM(`mobil`.`harga`) AS `harga`
FROM `pesanan`
JOIN `users` ON `users`.`id` = `pesanan`.`id_pemesan`
JOIN `mobil` ON `mobil`.`id_mobil` = `pesanan`.`id_mobil`
JOIN `perjalanan` ON `perjalanan`.`id_perjalanan` = `pesanan`.`id_perjalanan`
JOIN `jenis_bayar` ON `jenis_bayar`.`id_jenisbayar` = `pesanan`.`id_jenisbayar`
WHERE `pesanan`.`id_mobil` = '10'
AND `proses` = 2
AND YEAR(pesanan.tgl_pinjam) = '2023'

    public function PesananHariSum($id_mobil, $proses, $bulan, $tahun)
    {

        $db      = \Config\Database::connect();
        $builder = $db->table('pesanan');
        $builder->selectSum('pesanan.hari');
        $builder->join('users', 'users.id = pesanan.id_pemesan');
        $builder->join('mobil', 'mobil.id_mobil = pesanan.id_mobil');
        $builder->join('perjalanan', 'perjalanan.id_perjalanan = pesanan.id_perjalanan');
        $builder->join('jenis_bayar', 'jenis_bayar.id_jenisbayar = pesanan.id_jenisbayar');
        $builder->where('pesanan.id_mobil', $id_mobil);
        $builder->where('proses', $proses);
        $builder->where('MONTH(pesanan.tgl_pinjam)', $bulan);
        $builder->where('YEAR(pesanan.tgl_pinjam)', $tahun);
        $query = $builder->get();
---
SELECT SUM(`pesanan`.`hari`) AS `hari`
FROM `pesanan`
JOIN `users` ON `users`.`id` = `pesanan`.`id_pemesan`
JOIN `mobil` ON `mobil`.`id_mobil` = `pesanan`.`id_mobil`
JOIN `perjalanan` ON `perjalanan`.`id_perjalanan` = `pesanan`.`id_perjalanan`
JOIN `jenis_bayar` ON `jenis_bayar`.`id_jenisbayar` = `pesanan`.`id_jenisbayar`
WHERE `pesanan`.`id_mobil` = '10'
AND `proses` = 2
AND MONTH(pesanan.tgl_pinjam) = '8'
AND YEAR(pesanan.tgl_pinjam) = '2023'

    public function PesananHariSumTahun($id_mobil, $proses, $tahun)
    {

        $db      = \Config\Database::connect();
        $builder = $db->table('pesanan');
        $builder->selectSum('pesanan.hari');
        $builder->join('users', 'users.id = pesanan.id_pemesan');
        $builder->join('mobil', 'mobil.id_mobil = pesanan.id_mobil');
        $builder->join('perjalanan', 'perjalanan.id_perjalanan = pesanan.id_perjalanan');
        $builder->join('jenis_bayar', 'jenis_bayar.id_jenisbayar = pesanan.id_jenisbayar');
        $builder->where('pesanan.id_mobil', $id_mobil);
        $builder->where('proses', $proses);
        $builder->where('YEAR(pesanan.tgl_pinjam)', $tahun);
        $query = $builder->get();
---
SELECT SUM(`pesanan`.`hari`) AS `hari`
FROM `pesanan`
JOIN `users` ON `users`.`id` = `pesanan`.`id_pemesan`
JOIN `mobil` ON `mobil`.`id_mobil` = `pesanan`.`id_mobil`
JOIN `perjalanan` ON `perjalanan`.`id_perjalanan` = `pesanan`.`id_perjalanan`
JOIN `jenis_bayar` ON `jenis_bayar`.`id_jenisbayar` = `pesanan`.`id_jenisbayar`
WHERE `pesanan`.`id_mobil` = '10'
AND `proses` = 2
AND YEAR(pesanan.tgl_pinjam) = '2023'

    public function hitungJumlahMobil($id_mobil, $proses, $bulan, $tahun)
    {
        $db = \Config\Database::connect();
        $query = $db->table('pesanan');
        $query->selectCount('id_pesanan');
        $query->where('id_mobil', $id_mobil);
        $query->where('proses', $proses);
        $query->where('MONTH(pesanan.tgl_pinjam)', $bulan);
        $query->where('YEAR(pesanan.tgl_pinjam)', $tahun);
        $result = $query->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pesanan`
WHERE `id_mobil` = '10'
AND `proses` = 2
AND MONTH(pesanan.tgl_pinjam) IS NULL
AND YEAR(pesanan.tgl_pinjam) IS NULL

    public function hitungJumlahMobilTahun($id_mobil, $proses, $tahun)
    {
        $db = \Config\Database::connect();
        $query = $db->table('pesanan');
        $query->selectCount('id_pesanan');
        $query->where('id_mobil', $id_mobil);
        $query->where('proses', $proses);
        $query->where('YEAR(pesanan.tgl_pinjam)', $tahun);
        $result = $query->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pesanan`
WHERE `id_mobil` = '10'
AND `proses` = 2
AND YEAR(pesanan.tgl_pinjam) = '2023'

    public function joinPesananCust($id_pesanan = false)
    {
        if ($id_pesanan == false) {
            $db      = \Config\Database::connect();
            $builder = $db->table('pesanan');
            $id_pemesan = user()->id;
            $builder->select('*');
            $builder->join('users', 'users.id = pesanan.id_pemesan');
            $builder->join('mobil', 'mobil.id_mobil = pesanan.id_mobil');
            $builder->join('perjalanan', 'perjalanan.id_perjalanan = pesanan.id_perjalanan');
            $builder->join('jenis_bayar', 'jenis_bayar.id_jenisbayar = pesanan.id_jenisbayar');
            $builder->where('id_pemesan', $id_pemesan);
            $query = $builder->get();
---
SELECT *
FROM `pesanan`
JOIN `users` ON `users`.`id` = `pesanan`.`id_pemesan`
JOIN `mobil` ON `mobil`.`id_mobil` = `pesanan`.`id_mobil`
JOIN `perjalanan` ON `perjalanan`.`id_perjalanan` = `pesanan`.`id_perjalanan`
JOIN `jenis_bayar` ON `jenis_bayar`.`id_jenisbayar` = `pesanan`.`id_jenisbayar`
WHERE `id_pemesan` = '16'

    public function hitungJumlahPesananAll()
    {
        $db = \Config\Database::connect();
        $query = $db->table('pesanan');
        $query->selectCount('id_pesanan');
        $result = $query->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pesanan`

    public function hitungJumlahPesanan0()
    {
        $db = \Config\Database::connect();
        $query = $db->table('pesanan');
        $query->selectCount('id_pesanan');
        $query->where('proses', '0');
        $result = $query->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pesanan`
WHERE `proses` = '0'

    public function hitungJumlahPesanan1()
    {
        $db = \Config\Database::connect();
        $query = $db->table('pesanan');
        $query->selectCount('id_pesanan');
        $query->where('proses', '1');
        $result = $query->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pesanan`
WHERE `proses` = '1'

    public function hitungJumlahPesanan2()
    {
        $db = \Config\Database::connect();
        $query = $db->table('pesanan');
        $query->selectCount('id_pesanan');
        $query->where('proses', '2');
        $result = $query->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pesanan`
WHERE `proses` = '2'

    public function hitungJumlahPesananCust0()
    {
        $db = \Config\Database::connect();
        $query = $db->table('pesanan');
        $user = user()->id;
        $query->selectCount('id_pesanan');
        $query->where('id_pemesan', $user);
        $query->where('proses', '0');
        $result = $query->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pesanan`
WHERE `id_pemesan` = '16'
AND `proses` = '0'

    public function hitungJumlahPesananCust1()
    {
        $db = \Config\Database::connect();
        $query = $db->table('pesanan');
        $user = user()->id;
        $query->selectCount('id_pesanan');
        $query->where('id_pemesan', $user);
        $query->where('proses', '1');
        $result = $query->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pesanan`
WHERE `id_pemesan` = '16'
AND `proses` = '1'

    public function hitungJumlahPesananCust2()
    {
        $db = \Config\Database::connect();
        $query = $db->table('pesanan');
        $user = user()->id;
        $query->selectCount('id_pesanan');
        $query->where('id_pemesan', $user);
        $query->where('proses', '2');
        $result = $query->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pesanan`
WHERE `id_pemesan` = '16'
AND `proses` = '2'