app/Models/DataPemesanModel.php

SELECT *
FROM `users`
WHERE `id` = '16'
 LIMIT 1
---
    public function joinPemesan($id = false)
    {
        if ($id == false) {
            $db      = \Config\Database::connect();
            $builder = $db->table('users');
            $builder->select('*');
            $builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
            $builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
            $builder->where('group_id', 1);
            $query = $builder->get();